
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ОбновитьПовторноИспользуемыеЗначения();
	
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() Тогда Возврат КонецЕсли;
	#Если НЕ МобильноеПриложениеСервер Тогда	
		Нов = ПользователиИнформационнойБазы.СоздатьПользователя();
		Нов.Имя = "Администратор";
		Нов.Роли.Добавить(Метаданные.Роли.Администратор);
		Нов.Записать();
	#КонецЕсли
	
	Нов = ПользователиИнформационнойБазы.СоздатьПользователя();
	Нов.Имя = "Агент";
	Нов.Роли.Добавить(Метаданные.Роли.ОбычныеПрава);
	Нов.Записать();
КонецПроцедуры
