Функция НастройкиПодлючения() Экспорт
	СтруктураПодключения = Новый Структура;
	
	СтруктураПодключения.Вставить("ИспользуетсяSSL", Константы.ИспользуетсяSSL.Получить());
	
	АдресПодключения = Константы.АдресЦентральнойБазы.Получить();
	АдресПодключения = СтрЗаменить(АдресПодключения,"\", "/");
	ПолныйАдресСервера = СтрЗаменить(АдресПодключения,"http://","");
	ПолныйАдресСервера = СтрЗаменить(АдресПодключения,"https://","");
	
	СоставАдресСервера = СтрРазделить(ПолныйАдресСервера,"/",Ложь);
	ПутьПодключения = СтрЗаменить(ПолныйАдресСервера, СоставАдресСервера[0],"");	
	ПутьПодключения = ?(СтрЗаканчиваетсяНа(ПутьПодключения,"/"), Лев(ПутьПодключения, СтрДлина(ПутьПодключения)), ПутьПодключения);
	
	СтруктураПодключения.Вставить("ПользовательЦентральнойБазы", Константы.ПользовательЦентральнойБазы.Получить());
	СтруктураПодключения.Вставить("Пароль", Константы.Пароль.Получить());
	СтруктураПодключения.Вставить("СоставАдресСервера", СоставАдресСервера[0]);
	СтруктураПодключения.Вставить("ПутьПодключения", ПутьПодключения);
	
	Возврат СтруктураПодключения
КонецФункции

Функция ДанныеАвторизацииЗаполнены() Экспорт
	Возврат ЗначениеЗаполнено(Константы.АдресЦентральнойБазы.Получить());
КонецФункции

Функция КамераУстройстваФрагмент() Экспорт
	
	Возврат Константы.Камера.Получить();

КонецФункции

Функция РазрешениеУстройстваФрагмент() Экспорт
	
	Возврат Константы.РазрешениеФото.Получить();
	
КонецФункции
