&НаКлиенте
Функция КамераУстройства() Экспорт
	Камера = Служебный.КамераУстройстваФрагмент();
	Если НЕ ЗначениеЗаполнено(Камера) Тогда 
		Камера = ТипКамерыУстройства.Авто;
	КонецЕсли;
	Возврат Камера; 
КонецФункции


&НаКлиенте
Функция РазрешениеУстройства() Экспорт
	РазрешениеФото = Служебный.РазрешениеУстройстваФрагмент();
	Если НЕ ЗначениеЗаполнено(РазрешениеФото) Тогда 
		РазрешениеФото = Новый РазрешениеКамерыУстройства(0,0);
	КонецЕсли;
	Возврат РазрешениеФото;
КонецФункции

