
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Параметры.Входящие) Тогда
		UID = Новый УникальныйИдентификатор;	
	Иначе	
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.Входящие);
		ЗаполнитьФормуДаннымиСтроки();			
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработкаКоманды(НавигационнаяСсылкаФорматированнойСтроки)
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОС(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(Операция)
	#Если МобильноеПриложениеКлиент Тогда
		Результат = Неопределено; 
		ТипДанных = Неопределено;
		Камера = СлужебныйКлиент.КамераУстройства(); 
		РазрешениеФото = СлужебныйКлиент.РазрешениеУстройства();
		Если Операция = "ДобавитьФото" Тогда 
			Если СредстваМультимедиа.ПоддерживаетсяФотоснимок(Камера) Тогда
				
				Результат = СредстваМультимедиа.СделатьФотоснимок(Камера, РазрешениеФото);
				ТипДанных = ПредопределенноеЗначение("Перечисление.ТипХранимыхДанных.Фото");
			Иначе
				Сообщить("Не поддерживается фото!");
			КонецЕсли; 
		ИначеЕсли Операция = "СнятьВидео" Тогда
			Если СредстваМультимедиа.ПоддерживаетсяВидеозапись(Камера) Тогда
				Результат = СредстваМультимедиа.СделатьВидеозапись(Камера);
				ТипДанных = ПредопределенноеЗначение("Перечисление.ТипХранимыхДанных.Видео");
			Иначе
				Сообщить("Не поддерживается видео!");
			КонецЕсли; 
		ИначеЕсли Операция = "Аудио" Тогда
			Если СредстваМультимедиа.ПоддерживаетсяАудиозапись() Тогда
				Результат = СредстваМультимедиа.СделатьАудиозапись();
				ТипДанных = ПредопределенноеЗначение("Перечисление.ТипХранимыхДанных.Аудио");
			Иначе
				Сообщить("Не поддерживается аудио запись!");
			КонецЕсли; 
		КонецЕсли; 
		Если Результат = Неопределено Тогда 
			Сообщить("Отказ от действия!");
			Возврат;
		КонецЕсли;
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Данные", Результат.ПолучитьДвоичныеДанные());
		СтруктураДанных.Вставить("РасширениеФайла", Результат.РасширениеФайла);
		СтруктураДанных.Вставить("ТипДанных", ТипДанных);	
		СтруктураДанных.Вставить("UIDОбъекта", UID);	
		
		ОткрытьРезультатМультимедиа(СтруктураДанных);
		
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРезультатМультимедиа(СтрМультимедиа)
	ОткрытьФорму("РегистрСведений.ДанныеМультимедиа.ФормаЗаписи",Новый Структура("СтрДанных", СтрМультимедиа),ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФормуДаннымиСтроки()
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеМультимедиаСрезПоследних.UID КАК UID,
		|	ДанныеМультимедиаСрезПоследних.Данные КАК Данные,
		|	ДанныеМультимедиаСрезПоследних.Комментарий КАК Комментарий,
		|	ДанныеМультимедиаСрезПоследних.РасширениеФайла КАК РасширениеФайла,
		|	ДанныеМультимедиаСрезПоследних.ТипДанных КАК ТипДанных,
		|	ДанныеМультимедиаСрезПоследних.РазмерДанных КАК РазмерДанных
		|ИЗ
		|	РегистрСведений.ДанныеМультимедиа.СрезПоследних(, UIDОбъекта = &UIDОбъекта) КАК ДанныеМультимедиаСрезПоследних
		|ИТОГИ ПО
		|	ТипДанных";
	
	Запрос.УстановитьПараметр("UIDОбъекта", UID);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТипДанных = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТипДанных.Следующий() Цикл
		// Вставить обработку выборки ВыборкаТипДанных
		
		Если ВыборкаТипДанных.ТипДанных = Перечисления.ТипХранимыхДанных.Фото Тогда
			ВыборкаДетальныеЗаписи = ВыборкаТипДанных.Выбрать();
			Элементы.Фото.Заголовок = "Фото (скрыть: " + ВыборкаДетальныеЗаписи.Количество() + ")";
			Элементы.Фото.ЗаголовокСвернутогоОтображения = "Фото (показать: " + ВыборкаДетальныеЗаписи.Количество() + ")";
			Элементы.ДекорацияНетФото.Видимость = Ложь;
			Элементы.КнопкиФото.Видимость = Истина;
			ЗаполнениеФотографий(ВыборкаДетальныеЗаписи);
		ИначеЕсли ВыборкаТипДанных.ТипДанных = Перечисления.ТипХранимыхДанных.Видео Тогда
			ВыборкаДетальныеЗаписи = ВыборкаТипДанных.Выбрать();
			Элементы.Видео.Заголовок = "Видео (скрыть: " + ВыборкаДетальныеЗаписи.Количество() + ")";
			Элементы.Видео.ЗаголовокСвернутогоОтображения = "Видео (показать: " + ВыборкаДетальныеЗаписи.Количество() + ")";
			Элементы.ДекорацияНетВидео.Видимость = Ложь;
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Нов = ВидеоДанные.Добавить();
				Нов.UID = ВыборкаДетальныеЗаписи.UID;
				Нов.Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
				Нов.Размер = ПолучитьРазмер(ВыборкаДетальныеЗаписи.РазмерДанных)
			КонецЦикла;

		КонецЕсли;
		
		

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеФотографий(ВыборкаДетальныеЗаписи)
	
	ДобавляемыеРеквизиты = Новый Массив; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Реквизит = Новый РеквизитФормы("Рк" + СтрЗаменить(ВыборкаДетальныеЗаписи.UID,"-",""), Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки())); 
		ДобавляемыеРеквизиты.Добавить(Реквизит); 
	КонецЦикла;
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	ВыборкаДетальныеЗаписи.Сбросить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовЭл = Элементы.Добавить("Стр" + СтрЗаменить(ВыборкаДетальныеЗаписи.UID,"-",""), Тип("ГруппаФормы"), Элементы.ФотоСтраницы);
		НовЭл.Вид = ВидГруппыФормы.Страница;
		НовЭл.Заголовок = ВыборкаДетальныеЗаписи.РасширениеФайла + " " + ПолучитьРазмер(ВыборкаДетальныеЗаписи.РазмерДанных);
		НовЭл.РастягиватьПоВертикали = Истина;
		
		НовКр = Элементы.Добавить("КР" + СтрЗаменить(ВыборкаДетальныеЗаписи.UID,"-",""), Тип("ПолеФормы"), НовЭл);
		НовКр.Вид = ВидПоляФормы.ПолеКартинки;
		НовКр.ПутьКДанным = "Рк" + СтрЗаменить(ВыборкаДетальныеЗаписи.UID,"-","");
		НовКр.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		НовКр.РазмерКартинки = РазмерКартинки.Пропорционально;
		НовКр.РастягиватьПоВертикали = Истина;
		НовКр.Масштабировать = Истина;
		//НовКр.ТекстНевыбраннойКартинки = "Видать что-то пошло не так";
		ЭтаФорма["Рк" + СтрЗаменить(ВыборкаДетальныеЗаписи.UID,"-","")] = ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.Данные.Получить());
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьРазмер(Размер)
	Если Размер < 1024 Тогда
		Возврат ""+Размер + "Б";
	ИначеЕсли Размер < 1024*1024 Тогда 
		Возврат "" + Цел(Размер/1024) + "кБ";
	Иначе
		Возврат "" + Цел(Размер/(1024*1024)) + "мБ";
	КонецЕсли; 
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Структура = Новый Структура("UID, Имущество, НаличиеФактическое", UID, Имущество,НаличиеФактическое);
	Закрыть(Структура);
КонецПроцедуры

#Область РаботаСФото
&НаКлиенте
Процедура ДобавитьФото(Команда)
	ОбработкаКоманды("ДобавитьФото")
КонецПроцедуры


&НаКлиенте
Процедура РедактироватьФото(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФото(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти

#Область РаботаСВидео

&НаКлиенте
Процедура ДобавитьВидео(Команда)
	ОбработкаКоманды("СнятьВидео")
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВидео(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

