#Область Сериализация
Функция Сериализовать(ОбъектСериализации) Экспорт
	ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	МойXML = Новый ЗаписьXML;
	ПараметрыЗаписиXML = Новый ПараметрыЗаписиXML("UTF-8", "1.0", Ложь);
	МойXML.УстановитьСтроку(ПараметрыЗаписиXML);
	ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	Возврат МойXML.Закрыть();
КонецФункции
Функция Десериализовать(XMLСтруктураСериализованногоОбъекта, ОткрытьХранилище = Ложь) Экспорт
	ЧтениеXMLДанных = Новый ЧтениеXML;
	ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	ЧтениеXMLДанных.Закрыть();  
	Возврат ?(ОткрытьХранилище, ТЗ, ТЗ);
КонецФункции
#КонецОбласти

Функция ПроверкаПодключения() Экспорт
	Сервис = "checkUser";
	Данные = "Проверка подключения пользователя";	
	Ответ = ОтветОтСервера(Сервис,Данные);
	Возврат Ответ = Данные;
КонецФункции

Функция РезультатОбменаСЦБ(Данные) Экспорт
	Сервис = "getMainData";
	Ответ = ОтветОтСервера(Сервис,Данные);
	Возврат Ответ;
КонецФункции

Функция ОтветОтСервера(Сервис,Данные)
	
	НастройкиПодключения = Служебный.НастройкиПодлючения();
	Если НастройкиПодключения.ИспользуетсяSSL Тогда
		СертификатОпр = Новый ЗащищенноеСоединениеOpenSSL(,);
	Иначе
		СертификатОпр = Неопределено;
	КонецЕсли;
	
	ХТТП = Новый HTTPСоединение(НастройкиПодключения.СоставАдресСервера,,НастройкиПодключения.ПользовательЦентральнойБазы,НастройкиПодключения.Пароль,,, СертификатОпр);
	
	СтруктураЗапроса = Новый Соответствие;
	ХТТПЗапрос = Новый HTTPЗапрос(НастройкиПодключения.ПутьПодключения + "/hs/inv/" + Сервис ,СтруктураЗапроса);
	ХТТПЗапрос.УстановитьТелоИзСтроки(Данные);
	
	Ответ = ХТТП.ВызватьHTTPМетод("POST",ХТТПЗапрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка подключения к серверу: " + Символы.ПС + Ответ.КодСостояния + Символы.ПС + Ответ.ПолучитьТелоКакСтроку("UTF-8");
	КонецЕсли;
	Ответ = Ответ.ПолучитьТелоКакСтроку("UTF-8");
	Возврат Ответ;
КонецФункции